content/posts/20200623235920-developing_evergreen_notes.md
+++
title = "Developing Evergreen Notes"
author = ["Alex Day"]
lastmod = 2020-12-13T20:16:45-05:00
draft = false
+++

[Evergreen notes]({{< relref "20200623233650-evergreen_notes" >}}) don't just appear fully formed in your database. You have to go through an evolution:

1.  Stubs defined through backlinks
    A page can be defined by the context it is linked to, even if that page has no context.
2.  Simple definitions
3.  Exact notes on a specific subject
4.  High level abstract note

The evergreen note doesn't have to go through these explicit steps but this is a solid route to evergreen-ness


## References {#references}

[Andy's Note on this specific topic](https://notes.andymatuschak.org/Taxonomy%5Fof%5Fnote%5Ftypes)
